balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ64GA308.PIC
      <edc:DCRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CONFIG3" edc:default="0xffff" edc:desc="" edc:impl="0xffff" edc:name="CONFIG3" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WPFP" edc:desc="Write Protection Flash Page Segment Boundary" edc:mask="0x3f" edc:name="WPFP" edc:nzwidth="6">
              <edc:DCRFieldSemantic edc:cname="WPFP0" edc:desc="Page 0 (0x00)" edc:when="(field &amp; 0x3f) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="WPFP1" edc:desc="Page 1 (0x400)" edc:when="(field &amp; 0x3f) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WPFP2" edc:desc="Page 2 (0x800)" edc:when="(field &amp; 0x3f) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="WPFP3" edc:desc="Page 3 (0xC00)" edc:when="(field &amp; 0x3f) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="WPFP4" edc:desc="Page 4 (0x1000)" edc:when="(field &amp; 0x3f) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="WPFP5" edc:desc="Page 5 (0x1400)" edc:when="(field &amp; 0x3f) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="WPFP6" edc:desc="Page 6 (0x1800)" edc:when="(field &amp; 0x3f) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="WPFP7" edc:desc="Page 7 (0x1C00)" edc:when="(field &amp; 0x3f) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="WPFP8" edc:desc="Page 8 (0x2000)" edc:when="(field &amp; 0x3f) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="WPFP9" edc:desc="Page 9 (0x2400)" edc:when="(field &amp; 0x3f) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="WPFP10" edc:desc="Page 10 (0x2800)" edc:when="(field &amp; 0x3f) == 0xa"/>
              <edc:DCRFieldSemantic edc:cname="WPFP11" edc:desc="Page 11 (0x2C00)" edc:when="(field &amp; 0x3f) == 0xb"/>
              <edc:DCRFieldSemantic edc:cname="WPFP12" edc:desc="Page 12 (0x3000)" edc:when="(field &amp; 0x3f) == 0xc"/>
              <edc:DCRFieldSemantic edc:cname="WPFP13" edc:desc="Page 13 (0x3400)" edc:when="(field &amp; 0x3f) == 0xd"/>
              <edc:DCRFieldSemantic edc:cname="WPFP14" edc:desc="Page 14 (0x3800)" edc:when="(field &amp; 0x3f) == 0xe"/>
              <edc:DCRFieldSemantic edc:cname="WPFP15" edc:desc="Page 15 (0x3C00)" edc:when="(field &amp; 0x3f) == 0xf"/>
              <edc:DCRFieldSemantic edc:cname="WPFP16" edc:desc="Page 16 (0x4000)" edc:when="(field &amp; 0x3f) == 0x10"/>
              <edc:DCRFieldSemantic edc:cname="WPFP17" edc:desc="Page 17 (0x4400)" edc:when="(field &amp; 0x3f) == 0x11"/>
              <edc:DCRFieldSemantic edc:cname="WPFP18" edc:desc="Page 18 (0x4800)" edc:when="(field &amp; 0x3f) == 0x12"/>
              <edc:DCRFieldSemantic edc:cname="WPFP19" edc:desc="Page 19 (0x4C00)" edc:when="(field &amp; 0x3f) == 0x13"/>
              <edc:DCRFieldSemantic edc:cname="WPFP20" edc:desc="Page 20 (0x5000)" edc:when="(field &amp; 0x3f) == 0x14"/>
              <edc:DCRFieldSemantic edc:cname="WPFP21" edc:desc="Page 21 (0x5400)" edc:when="(field &amp; 0x3f) == 0x15"/>
              <edc:DCRFieldSemantic edc:cname="WPFP22" edc:desc="Page 22 (0x5800)" edc:when="(field &amp; 0x3f) == 0x16"/>
              <edc:DCRFieldSemantic edc:cname="WPFP23" edc:desc="Page 23 (0x5C00)" edc:when="(field &amp; 0x3f) == 0x17"/>
              <edc:DCRFieldSemantic edc:cname="WPFP24" edc:desc="Page 24 (0x6000)" edc:when="(field &amp; 0x3f) == 0x18"/>
              <edc:DCRFieldSemantic edc:cname="WPFP25" edc:desc="Page 25 (0x6400)" edc:when="(field &amp; 0x3f) == 0x19"/>
              <edc:DCRFieldSemantic edc:cname="WPFP26" edc:desc="Page 26 (0x6800)" edc:when="(field &amp; 0x3f) == 0x1a"/>
              <edc:DCRFieldSemantic edc:cname="WPFP27" edc:desc="Page 27 (0x6C00)" edc:when="(field &amp; 0x3f) == 0x1b"/>
              <edc:DCRFieldSemantic edc:cname="WPFP28" edc:desc="Page 28 (0x7000)" edc:when="(field &amp; 0x3f) == 0x1c"/>
              <edc:DCRFieldSemantic edc:cname="WPFP29" edc:desc="Page 29 (0x7400)" edc:when="(field &amp; 0x3f) == 0x1d"/>
              <edc:DCRFieldSemantic edc:cname="WPFP30" edc:desc="Page 30 (0x7800)" edc:when="(field &amp; 0x3f) == 0x1e"/>
              <edc:DCRFieldSemantic edc:cname="WPFP31" edc:desc="Page 31 (0x7C00)" edc:when="(field &amp; 0x3f) == 0x1f"/>
              <edc:DCRFieldSemantic edc:cname="WPFP32" edc:desc="Page 32 (0x8000)" edc:when="(field &amp; 0x3f) == 0x20"/>
              <edc:DCRFieldSemantic edc:cname="WPFP33" edc:desc="Page 33 (0x8400)" edc:when="(field &amp; 0x3f) == 0x21"/>
              <edc:DCRFieldSemantic edc:cname="WPFP34" edc:desc="Page 34 (0x8800)" edc:when="(field &amp; 0x3f) == 0x22"/>
              <edc:DCRFieldSemantic edc:cname="WPFP35" edc:desc="Page 35 (0x8C00)" edc:when="(field &amp; 0x3f) == 0x23"/>
              <edc:DCRFieldSemantic edc:cname="WPFP36" edc:desc="Page 36 (0x9000)" edc:when="(field &amp; 0x3f) == 0x24"/>
              <edc:DCRFieldSemantic edc:cname="WPFP37" edc:desc="Page 37 (0x9400)" edc:when="(field &amp; 0x3f) == 0x25"/>
              <edc:DCRFieldSemantic edc:cname="WPFP38" edc:desc="Page 38 (0x9800)" edc:when="(field &amp; 0x3f) == 0x26"/>
              <edc:DCRFieldSemantic edc:cname="WPFP39" edc:desc="Page 39 (0x9C00)" edc:when="(field &amp; 0x3f) == 0x27"/>
              <edc:DCRFieldSemantic edc:cname="WPFP40" edc:desc="Page 40 (0xA000)" edc:when="(field &amp; 0x3f) == 0x28"/>
              <edc:DCRFieldSemantic edc:cname="WPFP41" edc:desc="Page 41 (0xA400)" edc:when="(field &amp; 0x3f) == 0x29"/>
              <edc:DCRFieldSemantic edc:cname="WPFP42" edc:desc="Page 42 (0xA800)" edc:when="(field &amp; 0x3f) == 0x2a"/>
              <edc:DCRFieldSemantic edc:cname="WPFP43" edc:desc="Page 43 (0xAC00)" edc:when="(field &amp; 0x3f) == 0x2b"/>
              <edc:DCRFieldSemantic edc:cname="WPFP44" edc:desc="Page 44 (0xB000)" edc:when="(field &amp; 0x3f) == 0x2c"/>
              <edc:DCRFieldSemantic edc:cname="WPFP45" edc:desc="Page 45 (0xB400)" edc:when="(field &amp; 0x3f) == 0x2d"/>
              <edc:DCRFieldSemantic edc:cname="WPFP46" edc:desc="Page 46 (0xB800)" edc:when="(field &amp; 0x3f) == 0x2e"/>
              <edc:DCRFieldSemantic edc:cname="WPFP47" edc:desc="Page 47 (0xBC00)" edc:when="(field &amp; 0x3f) == 0x2f"/>
              <edc:DCRFieldSemantic edc:cname="WPFP48" edc:desc="Page 48 (0xC000)" edc:when="(field &amp; 0x3f) == 0x30"/>
              <edc:DCRFieldSemantic edc:cname="WPFP49" edc:desc="Page 49 (0xC400)" edc:when="(field &amp; 0x3f) == 0x31"/>
              <edc:DCRFieldSemantic edc:cname="WPFP50" edc:desc="Page 50 (0xC800)" edc:when="(field &amp; 0x3f) == 0x32"/>
              <edc:DCRFieldSemantic edc:cname="WPFP51" edc:desc="Page 51 (0xCC00)" edc:when="(field &amp; 0x3f) == 0x33"/>
              <edc:DCRFieldSemantic edc:cname="WPFP52" edc:desc="Page 52 (0xD000)" edc:when="(field &amp; 0x3f) == 0x34"/>
              <edc:DCRFieldSemantic edc:cname="WPFP53" edc:desc="Page 53 (0xD400)" edc:when="(field &amp; 0x3f) == 0x35"/>
              <edc:DCRFieldSemantic edc:cname="WPFP54" edc:desc="Page 54 (0xD800)" edc:when="(field &amp; 0x3f) == 0x36"/>
              <edc:DCRFieldSemantic edc:cname="WPFP55" edc:desc="Page 55 (0xDC00)" edc:when="(field &amp; 0x3f) == 0x37"/>
              <edc:DCRFieldSemantic edc:cname="WPFP56" edc:desc="Page 56 (0xE000)" edc:when="(field &amp; 0x3f) == 0x38"/>
              <edc:DCRFieldSemantic edc:cname="WPFP57" edc:desc="Page 57 (0xE400)" edc:when="(field &amp; 0x3f) == 0x39"/>
              <edc:DCRFieldSemantic edc:cname="WPFP58" edc:desc="Page 58 (0xE800)" edc:when="(field &amp; 0x3f) == 0x3a"/>
              <edc:DCRFieldSemantic edc:cname="WPFP59" edc:desc="Page 59 (0xEC00)" edc:when="(field &amp; 0x3f) == 0x3b"/>
              <edc:DCRFieldSemantic edc:cname="WPFP60" edc:desc="Page 60 (0xF000)" edc:when="(field &amp; 0x3f) == 0x3c"/>
              <edc:DCRFieldSemantic edc:cname="WPFP61" edc:desc="Page 61 (0xF400)" edc:when="(field &amp; 0x3f) == 0x3d"/>
              <edc:DCRFieldSemantic edc:cname="WPFP62" edc:desc="Page 62 (0xF800)" edc:when="(field &amp; 0x3f) == 0x3e"/>
              <edc:DCRFieldSemantic edc:cname="WPFP63" edc:desc="Page 52 (0xFC00)" edc:when="(field &amp; 0x3f) == 0x3f"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RES1" edc:desc="" edc:ishidden="true" edc:mask="0x1" edc:name="RES1" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:desc="" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="VBTBOR" edc:desc="VBAT BOR enable bit" edc:mask="0x1" edc:name="VBTBOR" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="VBAT BOR enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="VBAT BOR disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="SOSCSEL" edc:desc="SOSC Selection bits" edc:mask="0x1" edc:name="SOSCSEL" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="SOSC circuit selected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Digital (SCLKI) mode" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RES2" edc:desc="Reserved" edc:ishidden="true" edc:mask="0x1" edc:name="RES2" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTWIN" edc:desc="Watch Dog Timer Window Width" edc:mask="0x3" edc:name="WDTWIN" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="PS25_0" edc:desc="Watch Dog Timer Window Width is 25 percent" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PS37_5" edc:desc="Watch Dog Timer Window Width is 37.5 percent " edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="PS50_0" edc:desc="Watch Dog Timer Window Width is 50 percent" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="PS75_0" edc:desc="Watch Dog Timer Window Width is 75 percent" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BOREN" edc:desc="Brown-out Reset Enable" edc:mask="0x1" edc:name="BOREN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Brown-out Reset Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Brown-out Reset Enable" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WPDIS" edc:desc="Segment Write Protection Disable" edc:mask="0x1" edc:name="WPDIS" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="WPDIS" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WPEN" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WPCFG" edc:desc="Write Protect Configuration Page Select" edc:mask="0x1" edc:name="WPCFG" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="WPCFGDIS" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WPCFGEN" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WPEND" edc:desc="Segment Write Protection End Page Select" edc:mask="0x1" edc:name="WPEND" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="WPENDMEM" edc:desc="Write Protect from WPFP to the last page of memory" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WPSTARTMEM" edc:desc="Write Protect from page 0 to WPFP" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CONFIG2" edc:default="0xffff" edc:desc="" edc:impl="0xffff" edc:name="CONFIG2" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xffff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="POSCMD" edc:desc="Primary Oscillator Select" edc:mask="0x3" edc:name="POSCMD" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="NONE" edc:desc="Primary Oscillator Disabled" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS Oscillator Enabled" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="XT" edc:desc="XT Oscillator Enabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="EC" edc:desc="External-Clock Mode Enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RES0" edc:desc="Reserved" edc:ishidden="true" edc:mask="0x3" edc:name="RES0" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IOL1WAY" edc:desc="IOLOCK One-Way Set Enable bit" edc:mask="0x1" edc:name="IOL1WAY" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Once set, the IOLOCK bit cannot be cleared" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="The IOLOCK bit can be set and cleared using the unlock sequence" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="OSCIOFCN" edc:desc="OSCO Pin Configuration" edc:mask="0x1" edc:name="OSCIOFCN" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="OSCO/CLKO/RC15 functions as port I/O (RC15)" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="OSCO/CLKO/RC15 functions as CLKO (FOSC/2)" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FCKSM" edc:desc="Clock Switching and Fail-Safe Clock Monitor Configuration bits" edc:mask="0x3" edc:name="FCKSM" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="CSDCMD" edc:desc="Clock switching and Fail-Safe Clock Monitor are disabled" edc:when="(field &amp; 0x2) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="CSECMD" edc:desc="Clock switching is enabled, Fail-Safe Clock Monitor is disabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CSECME" edc:desc="Clock switching is enabled, Fail-Safe Clock Monitor is enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FNOSC" edc:desc="Initial Oscillator Select" edc:mask="0x7" edc:name="FNOSC" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="FRCDIV" edc:desc="Fast RC Oscillator with Postscaler (FRCDIV)" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="Low-Power RC Oscillator (LPRC)" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="Secondary Oscillator (SOSC)" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PRIPLL" edc:desc="Primary Oscillator with PLL module (XTPLL,HSPLL, ECPLL)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PRI" edc:desc="Primary Oscillator (XT, HS, EC)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="FRCPLL" edc:desc="Fast RC Oscillator with PLL module (FRCPLL)" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="FRC" edc:desc="Fast RC Oscillator (FRC)" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ALTVREF" edc:desc="Alternate VREF/CVREF Pins Selection bit" edc:mask="0x3" edc:name="ALTVREF" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="ALT_AV_ALT_CV" edc:desc="Voltage reference input, ADC =RB0/RB1   Comparator =RB0/RB1" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ALT_AV_DLT_CV" edc:desc="Voltage reference input, ADC =RB0/RB1   Comparator =RA9,RA10" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="DLT_AV_ALT_CV" edc:desc="Voltage reference input, ADC =RA9/RA10 Comparator =RB0,RB1" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="DLT_AV_DLT_CV" edc:desc="Voltage reference input, ADC =RA9/RA10 Comparator =RA9,RA10" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RES1" edc:desc="Reserved" edc:ishidden="true" edc:mask="0x3" edc:name="RES1" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IESO" edc:desc="Internal External Switchover" edc:mask="0x1" edc:name="IESO" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
