balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ64GA308.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="WREG12" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="WREG12" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG12" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="WREG12" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="WREG13" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="WREG13" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG13" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="WREG13" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="WREG14" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="WREG14" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG14" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="WREG14" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="WREG15" edc:desc="" edc:impl="0xfffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000100000000000" edc:name="WREG15" edc:nzwidth="0x10" edc:por="0000100000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG15" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="WREG15" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="SPLIM" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="SPLIM" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPLIM" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="SPLIM" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="12"/>
        <edc:JoinedSFRDef edc:cname="PC" edc:desc="" edc:islanghidden="true" edc:name="PC" edc:nzwidth="0x18">
          <edc:SFRModeList/>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="PC"/>
          <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="PCL" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="PCL" edc:nzwidth="0x10" edc:por="0000000000000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PCL" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="PCL" edc:nzwidth="0x10"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="--------rrrrrrrr" edc:cname="PCH" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="PCH" edc:nzlangwidth="0x8" edc:nzwidth="0x10" edc:por="--------00000000">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PCH" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="PCH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="------nnnnnnnnnn" edc:cname="DSRPAG" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------0000000000" edc:name="DSRPAG" edc:nzwidth="16" edc:por="------0000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DSRPAG" edc:desc="" edc:islanghidden="true" edc:mask="0x3ff" edc:name="DSRPAG" edc:nzwidth="10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------nnnnnnnnn" edc:cname="DSWPAG" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------000000000" edc:name="DSWPAG" edc:nzwidth="16" edc:por="-------000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DSWPAG" edc:desc="" edc:islanghidden="true" edc:mask="0x1ff" edc:name="DSWPAG" edc:nzwidth="9"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="RCOUNT" edc:desc="" edc:impl="0x3fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxx" edc:name="RCOUNT" edc:nzwidth="0x10" edc:por="xxxxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RCOUNT" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="RCOUNT" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="10"/>
        <edc:SFRDef edc:access="-------nnnnrnnnn" edc:cname="SR" edc:desc="" edc:impl="0x1ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------000000000" edc:name="SR" edc:nzwidth="0x10" edc:por="-------000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C" edc:desc="" edc:mask="0x1" edc:name="C" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="Z" edc:desc="" edc:mask="0x1" edc:name="Z" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OV" edc:desc="" edc:mask="0x1" edc:name="OV" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="N" edc:desc="" edc:mask="0x1" edc:name="N" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA" edc:desc="" edc:mask="0x1" edc:name="RA" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IPL" edc:desc="" edc:mask="0x7" edc:name="IPL" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="DC" edc:desc="" edc:mask="0x1" edc:name="DC" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="IPL0" edc:desc="" edc:mask="0x1" edc:name="IPL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IPL1" edc:desc="" edc:mask="0x1" edc:name="IPL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IPL2" edc:desc="" edc:mask="0x1" edc:name="IPL2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------------c---" edc:cname="CORCON" edc:desc="" edc:impl="0x8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------0---" edc:name="CORCON" edc:nzwidth="0x10" edc:por="------------0---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IPL3" edc:desc="" edc:mask="0x1" edc:name="IPL3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="12"/>
        <edc:SFRDef edc:access="--nnnnnnnnnnnnnn" edc:cname="DISICNT" edc:desc="" edc:impl="0x3fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--xxxxxxxxxxxxxx" edc:name="DISICNT" edc:nzwidth="0x10" edc:por="--xxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DISICNT" edc:desc="" edc:islanghidden="true" edc:mask="0x3fff" edc:name="DISICNT" edc:nzwidth="14"/>
              <edc:AdjustPoint edc:offset="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="TBLPAG" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="TBLPAG" edc:nzlangwidth="0x10" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TBLPAG" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="TBLPAG" edc:nzwidth="8"/>
              <edc:AdjustPoint edc:offset="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnn--" edc:cname="CNPD1" edc:desc="" edc:impl="0xfffc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000--" edc:name="CNPD1" edc:nzwidth="0x10" edc:por="00000000000000--">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN2PDE" edc:desc="" edc:mask="0x1" edc:name="CN2PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN3PDE" edc:desc="" edc:mask="0x1" edc:name="CN3PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN4PDE" edc:desc="" edc:mask="0x1" edc:name="CN4PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN5PDE" edc:desc="" edc:mask="0x1" edc:name="CN5PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN6PDE" edc:desc="" edc:mask="0x1" edc:name="CN6PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN7PDE" edc:desc="" edc:mask="0x1" edc:name="CN7PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN8PDE" edc:desc="" edc:mask="0x1" edc:name="CN8PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN9PDE" edc:desc="" edc:mask="0x1" edc:name="CN9PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN10PDE" edc:desc="" edc:mask="0x1" edc:name="CN10PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN11PDE" edc:desc="" edc:mask="0x1" edc:name="CN11PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN12PDE" edc:desc="" edc:mask="0x1" edc:name="CN12PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN13PDE" edc:desc="" edc:mask="0x1" edc:name="CN13PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN14PDE" edc:desc="" edc:mask="0x1" edc:name="CN14PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN15PDE" edc:desc="" edc:mask="0x1" edc:name="CN15PDE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="CNPD2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="CNPD2" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN16PDE" edc:desc="" edc:mask="0x1" edc:name="CN16PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN17PDE" edc:desc="" edc:mask="0x1" edc:name="CN17PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN18PDE" edc:desc="" edc:mask="0x1" edc:name="CN18PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN19PDE" edc:desc="" edc:mask="0x1" edc:name="CN19PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN20PDE" edc:desc="" edc:mask="0x1" edc:name="CN20PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN21PDE" edc:desc="" edc:mask="0x1" edc:name="CN21PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN22PDE" edc:desc="" edc:mask="0x1" edc:name="CN22PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN23PDE" edc:desc="" edc:mask="0x1" edc:name="CN23PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN24PDE" edc:desc="" edc:mask="0x1" edc:name="CN24PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN25PDE" edc:desc="" edc:mask="0x1" edc:name="CN25PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN26PDE" edc:desc="" edc:mask="0x1" edc:name="CN26PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN27PDE" edc:desc="" edc:mask="0x1" edc:name="CN27PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN28PDE" edc:desc="" edc:mask="0x1" edc:name="CN28PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN29PDE" edc:desc="" edc:mask="0x1" edc:name="CN29PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN30PDE" edc:desc="" edc:mask="0x1" edc:name="CN30PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN31PDE" edc:desc="" edc:mask="0x1" edc:name="CN31PDE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnn--------n" edc:cname="CNPD3" edc:desc="" edc:impl="0xfe01" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000--------0" edc:name="CNPD3" edc:nzwidth="0x10" edc:por="0000000--------0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN32PDE" edc:desc="" edc:mask="0x1" edc:name="CN32PDE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN41PDE" edc:desc="" edc:mask="0x1" edc:name="CN41PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN42PDE" edc:desc="" edc:mask="0x1" edc:name="CN42PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN43PDE" edc:desc="" edc:mask="0x1" edc:name="CN43PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN44PDE" edc:desc="" edc:mask="0x1" edc:name="CN44PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN45PDE" edc:desc="" edc:mask="0x1" edc:name="CN45PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN46PDE" edc:desc="" edc:mask="0x1" edc:name="CN46PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN47PDE" edc:desc="" edc:mask="0x1" edc:name="CN47PDE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnn-" edc:cname="CNPD4" edc:desc="" edc:impl="0xfffe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000000000-" edc:name="CNPD4" edc:nzwidth="0x10" edc:por="000000000000000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN49PDE" edc:desc="" edc:mask="0x1" edc:name="CN49PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN50PDE" edc:desc="" edc:mask="0x1" edc:name="CN50PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN51PDE" edc:desc="" edc:mask="0x1" edc:name="CN51PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN52PDE" edc:desc="" edc:mask="0x1" edc:name="CN52PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN53PDE" edc:desc="" edc:mask="0x1" edc:name="CN53PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN54PDE" edc:desc="" edc:mask="0x1" edc:name="CN54PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN55PDE" edc:desc="" edc:mask="0x1" edc:name="CN55PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN56PDE" edc:desc="" edc:mask="0x1" edc:name="CN56PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN57PDE" edc:desc="" edc:mask="0x1" edc:name="CN57PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN58PDE" edc:desc="" edc:mask="0x1" edc:name="CN58PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN59PDE" edc:desc="" edc:mask="0x1" edc:name="CN59PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN60PDE" edc:desc="" edc:mask="0x1" edc:name="CN60PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN61PDE" edc:desc="" edc:mask="0x1" edc:name="CN61PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN62PDE" edc:desc="" edc:mask="0x1" edc:name="CN62PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN63PDE" edc:desc="" edc:mask="0x1" edc:name="CN63PDE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nn--nnnnnnnnnnn" edc:cname="CNPD5" edc:desc="" edc:impl="0x67ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-00--00000000000" edc:name="CNPD5" edc:nzwidth="0x10" edc:por="-00--00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN64PDE" edc:desc="" edc:mask="0x1" edc:name="CN64PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN65PDE" edc:desc="" edc:mask="0x1" edc:name="CN65PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN66PDE" edc:desc="" edc:mask="0x1" edc:name="CN66PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN67PDE" edc:desc="" edc:mask="0x1" edc:name="CN67PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN68PDE" edc:desc="" edc:mask="0x1" edc:name="CN68PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN69PDE" edc:desc="" edc:mask="0x1" edc:name="CN69PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN70PDE" edc:desc="" edc:mask="0x1" edc:name="CN70PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN71PDE" edc:desc="" edc:mask="0x1" edc:name="CN71PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN72PDE" edc:desc="" edc:mask="0x1" edc:name="CN72PDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN73PDE" edc:desc="" edc:mask="0x1" edc:name="CN73PDE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CN74PDE" edc:desc="" edc:mask="0x1" edc:name="CN74PDE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN77PDE" edc:desc="" edc:mask="0x1" edc:name="CN77PDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN78PDE" edc:desc="" edc:mask="0x1" edc:name="CN78PDE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
