balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ64GA308.PIC
        <edc:SFRDef edc:access="--nn-----nnnnnnn" edc:cname="PORTF" edc:desc="" edc:impl="0xfe7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--xx-----xxxxxxx" edc:name="PORTF" edc:nzwidth="0x10" edc:por="--xx-----xxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RF0" edc:desc="" edc:mask="0x1" edc:name="RF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF1" edc:desc="" edc:mask="0x1" edc:name="RF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF2" edc:desc="" edc:mask="0x1" edc:name="RF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF3" edc:desc="" edc:mask="0x1" edc:name="RF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF4" edc:desc="" edc:mask="0x1" edc:name="RF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF5" edc:desc="" edc:mask="0x1" edc:name="RF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RF6" edc:desc="" edc:mask="0x1" edc:name="RF6" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RF12" edc:desc="" edc:mask="0x1" edc:name="RF12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RF13" edc:desc="" edc:mask="0x1" edc:name="RF13" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RF" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="RF" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nn-----nnnnnnn" edc:cname="LATF" edc:desc="" edc:impl="0xfe7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--xx-----xxxxxxx" edc:name="LATF" edc:nzwidth="0x10" edc:por="--xx-----xxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATF0" edc:desc="" edc:mask="0x1" edc:name="LATF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATF1" edc:desc="" edc:mask="0x1" edc:name="LATF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATF2" edc:desc="" edc:mask="0x1" edc:name="LATF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATF3" edc:desc="" edc:mask="0x1" edc:name="LATF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATF4" edc:desc="" edc:mask="0x1" edc:name="LATF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATF5" edc:desc="" edc:mask="0x1" edc:name="LATF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATF6" edc:desc="" edc:mask="0x1" edc:name="LATF6" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LATF12" edc:desc="" edc:mask="0x1" edc:name="LATF12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LATF13" edc:desc="" edc:mask="0x1" edc:name="LATF13" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATF" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="LATF" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nn-----nnnnnnn" edc:cname="ODCF" edc:desc="" edc:impl="0xfe7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00-----0000000" edc:name="ODCF" edc:nzwidth="0x10" edc:por="--00-----0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODF0" edc:desc="" edc:mask="0x1" edc:name="ODF0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODF1" edc:desc="" edc:mask="0x1" edc:name="ODF1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODF2" edc:desc="" edc:mask="0x1" edc:name="ODF2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODF3" edc:desc="" edc:mask="0x1" edc:name="ODF3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODF4" edc:desc="" edc:mask="0x1" edc:name="ODF4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODF5" edc:desc="" edc:mask="0x1" edc:name="ODF5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODF6" edc:desc="" edc:mask="0x1" edc:name="ODF6" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ODF12" edc:desc="" edc:mask="0x1" edc:name="ODF12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODF13" edc:desc="" edc:mask="0x1" edc:name="ODF13" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="ODCF" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="ODCF" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nnnn--nnnn" edc:cname="TRISG" edc:desc="" edc:impl="0xfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------1111--1111" edc:name="TRISG" edc:nzwidth="0x10" edc:por="------1111--1111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TRISG0" edc:desc="" edc:mask="0x1" edc:name="TRISG0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISG1" edc:desc="" edc:mask="0x1" edc:name="TRISG1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISG2" edc:desc="" edc:mask="0x1" edc:name="TRISG2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISG3" edc:desc="" edc:mask="0x1" edc:name="TRISG3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TRISG6" edc:desc="" edc:mask="0x1" edc:name="TRISG6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRISG7" edc:desc="" edc:mask="0x1" edc:name="TRISG7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISG8" edc:desc="" edc:mask="0x1" edc:name="TRISG8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRISG9" edc:desc="" edc:mask="0x1" edc:name="TRISG9" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="TRISG" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="TRISG" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
