balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ64GA308.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="DMASRC4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="DMASRC4" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SADDR" edc:desc="" edc:mask="0xffff" edc:name="SADDR" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="DMADST4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="DMADST4" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DADDR" edc:desc="" edc:mask="0xffff" edc:name="DADDR" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="DMACNT4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000001" edc:name="DMACNT4" edc:nzwidth="16" edc:por="0000000000000001">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CNT" edc:desc="" edc:mask="0xffff" edc:name="CNT" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnnnnnnnnnn" edc:cname="DMACH5" edc:desc="" edc:impl="0x7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00000000000" edc:name="DMACH5" edc:nzwidth="16" edc:por="-----00000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CHEN" edc:desc="" edc:mask="0x1" edc:name="CHEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BYTE" edc:desc="" edc:mask="0x1" edc:name="BYTE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRMODE" edc:desc="" edc:mask="0x3" edc:name="TRMODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DAMODE" edc:desc="" edc:mask="0x3" edc:name="DAMODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="SAMODE" edc:desc="" edc:mask="0x3" edc:name="SAMODE" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CHREQ" edc:desc="" edc:mask="0x1" edc:name="CHREQ" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RELOAD" edc:desc="" edc:mask="0x1" edc:name="RELOAD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NULLW" edc:desc="" edc:mask="0x1" edc:name="NULLW" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="TRMODE0" edc:desc="" edc:mask="0x1" edc:name="TRMODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRMODE1" edc:desc="" edc:mask="0x1" edc:name="TRMODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAMODE0" edc:desc="" edc:mask="0x1" edc:name="DAMODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DAMODE1" edc:desc="" edc:mask="0x1" edc:name="DAMODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SAMODE0" edc:desc="" edc:mask="0x1" edc:name="SAMODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SAMODE1" edc:desc="" edc:mask="0x1" edc:name="SAMODE1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nnnnnnnnnnn--n" edc:cname="DMAINT5" edc:desc="" edc:impl="0xbff9" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00000000000--0" edc:name="DMAINT5" edc:nzwidth="16" edc:por="0-00000000000--0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="HALFEN" edc:desc="" edc:mask="0x1" edc:name="HALFEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="OVRUNIF" edc:desc="" edc:mask="0x1" edc:name="OVRUNIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HALFIF" edc:desc="" edc:mask="0x1" edc:name="HALFIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DONEIF" edc:desc="" edc:mask="0x1" edc:name="DONEIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LOWIF" edc:desc="" edc:mask="0x1" edc:name="LOWIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HIGHIF" edc:desc="" edc:mask="0x1" edc:name="HIGHIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHSEL" edc:desc="" edc:mask="0x3f" edc:name="CHSEL" edc:nzwidth="6"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DBUFWF" edc:desc="" edc:mask="0x1" edc:name="DBUFWF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="CHSEL0" edc:desc="" edc:mask="0x1" edc:name="CHSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHSEL1" edc:desc="" edc:mask="0x1" edc:name="CHSEL1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHSEL2" edc:desc="" edc:mask="0x1" edc:name="CHSEL2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHSEL3" edc:desc="" edc:mask="0x1" edc:name="CHSEL3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHSEL4" edc:desc="" edc:mask="0x1" edc:name="CHSEL4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHSEL5" edc:desc="" edc:mask="0x1" edc:name="CHSEL5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="DMASRC5" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="DMASRC5" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SADDR" edc:desc="" edc:mask="0xffff" edc:name="SADDR" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="DMADST5" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="DMADST5" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DADDR" edc:desc="" edc:mask="0xffff" edc:name="DADDR" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="DMACNT5" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000001" edc:name="DMACNT5" edc:nzwidth="16" edc:por="0000000000000001">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CNT" edc:desc="" edc:mask="0xffff" edc:name="CNT" edc:nzwidth="16"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="282"/>
        <edc:SFRDef edc:access="-------------nnn" edc:cname="ANCFG" edc:desc="" edc:impl="0x9f00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------000" edc:name="ANCFG" edc:nzwidth="0x10" edc:por="-------------000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VBGEN" edc:desc="" edc:mask="0x1" edc:name="VBGEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VBG2EN" edc:desc="" edc:mask="0x1" edc:name="VBG2EN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="VBG6EN" edc:desc="" edc:mask="0x1" edc:name="VBG6EN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="ANSB" edc:desc="" edc:impl="0x9f00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="1111111111111111" edc:name="ANSB" edc:nzwidth="0x10" edc:por="1111111111111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSB0" edc:desc="" edc:mask="0x1" edc:name="ANSB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB1" edc:desc="" edc:mask="0x1" edc:name="ANSB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB2" edc:desc="" edc:mask="0x1" edc:name="ANSB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB3" edc:desc="" edc:mask="0x1" edc:name="ANSB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB4" edc:desc="" edc:mask="0x1" edc:name="ANSB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB5" edc:desc="" edc:mask="0x1" edc:name="ANSB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB6" edc:desc="" edc:mask="0x1" edc:name="ANSB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB7" edc:desc="" edc:mask="0x1" edc:name="ANSB7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB8" edc:desc="" edc:mask="0x1" edc:name="ANSB8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB9" edc:desc="" edc:mask="0x1" edc:name="ANSB9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB10" edc:desc="" edc:mask="0x1" edc:name="ANSB10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB11" edc:desc="" edc:mask="0x1" edc:name="ANSB11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB12" edc:desc="" edc:mask="0x1" edc:name="ANSB12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB13" edc:desc="" edc:mask="0x1" edc:name="ANSB13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB14" edc:desc="" edc:mask="0x1" edc:name="ANSB14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB15" edc:desc="" edc:mask="0x1" edc:name="ANSB15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="----nn--nn------" edc:cname="ANSD" edc:desc="" edc:impl="0x9f00" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----11--11------" edc:name="ANSD" edc:nzwidth="0x10" edc:por="----11--11------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="ANSD6" edc:desc="" edc:mask="0x1" edc:name="ANSD6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSD7" edc:desc="" edc:mask="0x1" edc:name="ANSD7" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ANSD10" edc:desc="" edc:mask="0x1" edc:name="ANSD10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSD11" edc:desc="" edc:mask="0x1" edc:name="ANSD11" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
