balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ64GA308.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA2" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S32C0" edc:desc="" edc:mask="0x1" edc:name="S32C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S33C0" edc:desc="" edc:mask="0x1" edc:name="S33C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S34C0" edc:desc="" edc:mask="0x1" edc:name="S34C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S35C0" edc:desc="" edc:mask="0x1" edc:name="S35C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S36C0" edc:desc="" edc:mask="0x1" edc:name="S36C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S37C0" edc:desc="" edc:mask="0x1" edc:name="S37C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S38C0" edc:desc="" edc:mask="0x1" edc:name="S38C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S39C0" edc:desc="" edc:mask="0x1" edc:name="S39C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S40C0" edc:desc="" edc:mask="0x1" edc:name="S40C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S41C0" edc:desc="" edc:mask="0x1" edc:name="S41C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S42C0" edc:desc="" edc:mask="0x1" edc:name="S42C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S43C0" edc:desc="" edc:mask="0x1" edc:name="S43C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S44C0" edc:desc="" edc:mask="0x1" edc:name="S44C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S45C0" edc:desc="" edc:mask="0x1" edc:name="S45C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S46C0" edc:desc="" edc:mask="0x1" edc:name="S46C0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S47C0" edc:desc="" edc:mask="0x1" edc:name="S47C0" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------------n-n" edc:cname="LCDDATA3" edc:desc="" edc:impl="0x5" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------------u-u" edc:name="LCDDATA3" edc:nzwidth="16" edc:por="-------------0-0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S48C0" edc:desc="" edc:mask="0x1" edc:name="S48C0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="S50C0" edc:desc="" edc:mask="0x1" edc:name="S50C0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA4" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S00C1" edc:desc="" edc:mask="0x1" edc:name="S00C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S01C1" edc:desc="" edc:mask="0x1" edc:name="S01C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S02C1" edc:desc="" edc:mask="0x1" edc:name="S02C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S03C1" edc:desc="" edc:mask="0x1" edc:name="S03C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S04C1" edc:desc="" edc:mask="0x1" edc:name="S04C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S05C1" edc:desc="" edc:mask="0x1" edc:name="S05C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S06C1" edc:desc="" edc:mask="0x1" edc:name="S06C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S07C1" edc:desc="" edc:mask="0x1" edc:name="S07C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S08C1" edc:desc="" edc:mask="0x1" edc:name="S08C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S09C1" edc:desc="" edc:mask="0x1" edc:name="S09C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S10C1" edc:desc="" edc:mask="0x1" edc:name="S10C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S11C1" edc:desc="" edc:mask="0x1" edc:name="S11C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S12C1" edc:desc="" edc:mask="0x1" edc:name="S12C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S13C1" edc:desc="" edc:mask="0x1" edc:name="S13C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S14C1" edc:desc="" edc:mask="0x1" edc:name="S14C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S15C1" edc:desc="" edc:mask="0x1" edc:name="S15C1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="LCDDATA5" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuuuuuuu" edc:name="LCDDATA5" edc:nzwidth="16" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="S16C1" edc:desc="" edc:mask="0x1" edc:name="S16C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S17C1" edc:desc="" edc:mask="0x1" edc:name="S17C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S18C1" edc:desc="" edc:mask="0x1" edc:name="S18C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S19C1" edc:desc="" edc:mask="0x1" edc:name="S19C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S20C1" edc:desc="" edc:mask="0x1" edc:name="S20C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S21C1" edc:desc="" edc:mask="0x1" edc:name="S21C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S22C1" edc:desc="" edc:mask="0x1" edc:name="S22C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S23C1" edc:desc="" edc:mask="0x1" edc:name="S23C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S24C1" edc:desc="" edc:mask="0x1" edc:name="S24C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S25C1" edc:desc="" edc:mask="0x1" edc:name="S25C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S26C1" edc:desc="" edc:mask="0x1" edc:name="S26C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S27C1" edc:desc="" edc:mask="0x1" edc:name="S27C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S28C1" edc:desc="" edc:mask="0x1" edc:name="S28C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S29C1" edc:desc="" edc:mask="0x1" edc:name="S29C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S30C1" edc:desc="" edc:mask="0x1" edc:name="S30C1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="S31C1" edc:desc="" edc:mask="0x1" edc:name="S31C1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
